type TourStep = {
  element: string;
  intro: string;
  step: number;
  visibility?: string;
};

export const SIDEBAR_TOUR_STEPS: Record<string, TourStep[]> = {
  notes: [
    {
      step: 1,
      element: '#sidebar-notes',
      intro:
        'در این قسمت می‌تونید بخش‌هایی رو که مربوط به چرخه‌های عملکردی هستن ببینید.',
    },
    {
      step: 2,
      element: '#sidebar-notes-goals',
      intro:
        'اینجا می‌تونید اهداف‌ و یا انتظاراتی رو که لیدرتون از شما داره، برای دوره‌ی پیش رو مستند کنید.',
    },
    {
      step: 3,
      element: '#sidebar-notes-forms',
      intro:
        'در این بخش می‌تونید در بازه‌های معینی که بهتون اطلاع داده می‌شه، همکارانی رو که با توجه به نقش و جای شما در سازمان برای ارزیابی در دسترس شما هستن ارزیابی کنید.',
    },
    {
      step: 4,
      element: '#sidebar-notes-my-forms',
      intro:
        'اگر فرمی برای ارزیابی خود شما در اختیار دیگران قرار گرفته‌باشه، پس از پایان مهلت ارزیابی، می‌تونید نتیجه‌اش رو در این بخش مشاهده کنید.',
    },
  ],
  promotion: [
    {
      step: 1,
      element: '#sidebar-promotion',
      intro:
        'این بخش مربوط به پروپوزال‌های مختلف شماست. نتیجه‌ی بررسی کمیته، بعد از برگزاری جلسه زیر هر پروپوزال به شما نمایش داده می‌شه.',
    },
    {
      step: 2,
      element: '#sidebar-promotion-promotion',
      intro:
        'زمانی که به نظرتون با توجه به لدر تخصصی‌تون تغییر سطح داشتید، می‌تونید با هماهنگی لیدرتون پروپوزال ارتقا ثبت کنید.',
    },
    {
      step: 3,
      element: '#sidebar-promotion-mapping',
      intro:
        'زمانی که هنوز روی لدرهای ستون جای‌نمایی نشدید، باید با نگارش پروپوزال مپینگ برای مشخص شدن سطح‌تون اقدام کنید. (زمان‌بندی رو با اچ‌آر هماهنگ کنید)',
    },
    {
      step: 4,
      element: '#sidebar-promotion-evaluation',
      intro:
        'در هر بازه‌ای از زمان ممکنه از سمت سازمان، لیدر، و یا خودتون اعلام نیاز به بررسی عملکرد بشه. در این شرایط باید با نوشتن خودارزیابی برای بررسی عملکردتون اقدام کنید.',
    },
  ],
  feedback: [
    {
      step: 1,
      element: '#sidebar-feedback',
      intro:
        'این بخش مربوط به قابلیت ارسال و درخواست بازخورد در مرلینه. بازخوردها می‌تونن ساختاریافته و یا متن‌آزاد باشن.',
    },
    {
      step: 2,
      element: '#sidebar-feedback-feedback-request',
      intro:
        'اینجا می‌تونید با ارسال درخواست از همکارهاتون بازخورد بخواید. همچنین درخواست‌های دریافتی از سمت دیگران هم در تب مخصوص به شما نمایش داده می‌شه.',
    },
    {
      step: 3,
      element: '#sidebar-feedback-adhoc-feedback',
      intro:
        'این جا می‌تونید بدون این که درخواستی دریافت کرده باشید به همکارتون بازخورد بدید. همچنین بازخوردهای مستقیم دریافتی از سمت دیگران هم در تب مخصوص به شما نمایش داده می‌شه.',
    },
  ],
  personal: [
    {
      step: 1,
      element: '#sidebar-personal',
      intro: 'این بخش شامل قابلیت‌های متنوعیه که به نقش و کار شما بستگی دارن.',
    },
    {
      step: 2,
      element: '#sidebar-personal-meetings',
      intro:
        'اینجا می‌تونید صورت‌جلسه‌ی جلسه‌های مختلفی که می‌رید رو مستند کنید.',
    },
    {
      step: 3,
      element: '#sidebar-personal-templates',
      intro:
        'با تعریف کردن قالب‌های متنی در این بخش، می‌تونید در تمام بخش‌های دیگه ازشون استفاده کنید.',
    },
    {
      step: 4,
      element: '#sidebar-personal-performance-table',
      intro:
        'با توجه به نقش و جایگاه شما در سازمان، ممکنه دسترسی مشاهده‌ی اطلاعات عملکردی افراد مختلفی رو داشته‌باشید. ',
      visibility: 'showPerformanceTable',
    },
  ],
  'my-team': [
    {
      step: 1,
      element: '#sidebar-my-team',
      intro: 'این بخش مربوط به قابلیت‌های مخصوص تیم یا ترد شماست.',
    },
    {
      step: 2,
      element: '#sidebar-my-team-my-team',
      intro:
        'در این بخش می‌تونید افرادی رو که لیدرشون هستید مشاهده کنید و به تفکیک کاربر، تمام یادداشت‌هایی رو که ثبت کردن و به اون‌ها دسترسی دارید ببینید.',
      visibility: 'isTeamLeader',
    },
    {
      step: 3,
      element: '#sidebar-my-team-one-on-one',
      intro:
        'این بخش مخصوص یک‌به‌یک‌های شماست. در این بخش می‌تونید یک‌به‌یک‌هایی که با لیدرتون دارید رو مشاهده کنید. همچنین اگر خودتون لیدر هستید، می‌تونید برای افراد تیم‌تون یک‌به‌یک ثبت کنید.',
    },
  ],
  messages: [
    {
      step: 1,
      element: '#sidebar-messages',
      intro:
        'تمام اعلان‌های دریافتی در اینجا به شما نمایش داده می‌شن. با مراجعه به این بخش می‌تونید اعلان‌ها رو به تفکیک نوع، و به همراه فیلترهای مختلف جانبی مشاهده کنید.',
    },
  ],
  users: [
    {
      step: 1,
      element: '#sidebar-users',
      intro:
        'اینجا می‌تونید لیست تمام کاربران مرلین رو مشاهده کنید. بنا به نقش و جایگاه‌تون ممکنه دسترسی مشاهده‌ی تاریخچه‌ی عملکردی برخی رو هم داشته‌باشید.',
    },
  ],
  profile: [
    {
      step: 1,
      element: '#sidebar-profile',
      intro:
        'اینجا پروفایل کاربری شماست. با مراجعه به این بخش می‌تونید اطلاعات عمومی مربوط به خودتون، و تاریخچه‌ی عملکردی خودتون رو مشاهده کنید.',
    },
  ],
};
